#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2022/5/23 10:07
# @Author : WeiHua

import json
import os

import cv2
from tqdm import tqdm
import numpy as np
import imagesize

def convert_format(anno_file, img_dir, out_file):
    with open(anno_file, 'r', encoding='utf-8') as f:
        src_data = json.load(f)
    anno_dict = dict()
    for anno in src_data['annotations']:
        if anno['image_id'] not in anno_dict:
            anno_dict[anno['image_id']] = [anno]
        else:
            anno_dict[anno['image_id']].append(anno)
    dst_data = list()
    for image_anno in tqdm(src_data['images']):
        assert os.path.exists(os.path.join(img_dir, image_anno['file_name'])), f"missing: {image_anno['file_name']}"
        # img = cv2.imread(os.path.join(img_dir, image_anno['file_name']))
        # assert img.shape[0] == image_anno['height']
        # assert img.shape[1] == image_anno['width']
        w, h = imagesize.get(os.path.join(img_dir, image_anno['file_name']))
        assert h == image_anno['height']
        assert w == image_anno['width']
        out_format = {
            'file_name': image_anno['file_name'],
            'height': image_anno['height'],
            'width': image_anno['width'],
            'annotations': []
        }
        if image_anno['id'] not in anno_dict:
            print(f"Missing {image_anno['id']}'s annotation, pass it.")
            continue
        for anno in anno_dict[image_anno['id']]:
            ins_anno = {
                'polygon': anno['segmentation'][0],
                'text': anno['rec']
            }
            if 'text' == '###' or anno['iscrowd'] or len(anno['segmentation']) > 1:
                print(f"Invalid instance:{anno} of {image_anno['id']}")
                exit()
            out_format['annotations'].append(ins_anno)
        dst_data.append(out_format)

    print(f"In total, loaded {len(dst_data)} samples.")
    with open(out_file, 'w', encoding='utf-8') as f:
        for sample_ in dst_data:
            out_str = json.dumps(sample_, ensure_ascii=False)
            f.write(out_str+'\n')

def vis_tool(files, img_dir):
    # specify_file = 'SGP_82.jpg'
    specify_file = None
    for file_ in files:
        with open(file_, 'r', encoding='utf-8') as f:
            for line in tqdm(f.readlines()):
                info_ = json.loads(line.strip())
                if specify_file:
                    if specify_file not in info_['file_name']:
                        continue
                img = cv2.imread(os.path.join(img_dir, info_['file_name']))
                for idx, anno in enumerate(info_['annotations']):
                    poly = np.array(anno['polygon'], dtype=np.int)
                    cv2.polylines(img, [poly.reshape(-1, 2)], isClosed=True, thickness=1, color=(0, 0, 255))
                    cv2.putText(img, str(idx), (poly[0], poly[1]), cv2.FONT_HERSHEY_COMPLEX, 1.0, (0, 0, 255))
                    print(f"idx:{idx}, text:{anno['text']}")
                cv2.imshow('img', img)
                cv2.waitKey(0)


def dataset_info(anno_file, ephoie_dict, out_dict):
    # get ocr dict and dataset information
    avg_width = 0
    avg_height = 0
    img_cnt = 0
    max_text_len = 0
    with open(ephoie_dict, 'r', encoding='utf-8') as f:
        default_dict = json.load(f)
    cur_dict = []
    total_instance_num = 0
    max_instance_num = 0
    min_instance_num = 999
    avg_ins_width = 0
    avg_ins_height = 0
    max_pt_num = 0
    with open(anno_file, 'r', encoding='utf-8') as f:
        for line in tqdm(f.readlines()):
            info_ = json.loads(line.strip())
            avg_height += info_['height']
            avg_width += info_['width']
            img_cnt += 1
            num_instance = len(info_['annotations'])
            total_instance_num += num_instance
            max_instance_num = max(max_instance_num, num_instance)
            min_instance_num = min(min_instance_num, num_instance)
            for anno in info_['annotations']:
                max_pt_num = max(max_pt_num, len(anno['polygon'])//2)
                avg_ins_width += (max(anno['polygon'][0::2]) - min(anno['polygon'][0::2]))
                avg_ins_height += (max(anno['polygon'][1::2]) - min(anno['polygon'][1::2]))
                max_text_len = max(max_text_len, len(anno['text']))
                for char_ in anno['text']:
                    if char_ not in cur_dict:
                        cur_dict.append(char_)
    print(f"Total sample num: {img_cnt}")
    print(f"max_pt_num:{max_pt_num}")
    print(f"avg_ins:{total_instance_num / img_cnt}, max:{max_instance_num}, min:{min_instance_num}")
    print(f"avg_height:{avg_height / img_cnt}, avg_width:{avg_width / img_cnt}")
    print(f"max_len:{max_text_len}")
    print(
        f"avg_ins_height:{avg_ins_height / total_instance_num}, avg_ins_width:{avg_ins_width / total_instance_num}")
    missing_key = []
    ext_key = []
    for key in default_dict:
        if key not in cur_dict:
            missing_key.append(key)
    for key in cur_dict:
        if key not in default_dict:
            ext_key.append(key)
    print(f"Missing key:\n{missing_key}")
    print(f"External key:\n{ext_key}")
    default_dict.extend(ext_key)
    with open(out_dict, 'w', encoding='utf-8') as f:
        json.dump(default_dict, f, ensure_ascii=False)


if __name__ == '__main__':
    anno_file = r'E:\Dataset\KIE\Rec_Pretrain\ChnSyntext\syntext\annotations/syn130k_word_train.json'
    img_dir = r'E:\Dataset\KIE\Rec_Pretrain\ChnSyntext\syntext/syn_130k_images'
    out_file = r'E:\Dataset\KIE\Rec_Pretrain\ChnSyntext\syntext/custom_json_format.txt'
    # convert_format(anno_file, img_dir, out_file)

    files = [r'E:\Dataset\KIE\Rec_Pretrain\ChnSyntext\syntext/custom_json_format.txt']
    # vis_tool(files, img_dir)

    anno_file = r'E:\Dataset\KIE\Rec_Pretrain\ChnSyntext\syntext/custom_json_format.txt'
    ephoie_dict = r'E:\Dataset\KIE\EPHOIE\e2e_format/dict.json'
    out_dict = r'E:\Dataset\KIE\Rec_Pretrain\ChnSyntext\syntext/custom_dict.json'
    dataset_info(anno_file, ephoie_dict, out_dict)
    """
    Total sample num: 134514
    max_pt_num:4
    avg_ins:11.237142602257014, max:321, min:1
    avg_height:420.61183222564193, avg_width:487.8559555139242
    max_len:71
    avg_ins_height:35.7767097812647, avg_ins_width:81.25013148728493
    Missing key:
    [' ', ',', '°', '•', 'Ⅰ', 'Ⅱ', '〇', '斥', '檫', '诫', '谍', '辩', '＋']
    External key:
    ['窄', '巷', '饭', '店', '厂', '酒', '蜂', '洞', '勒', '沟', '巨', '库', '站', '塔', '坪', '岭', '坟', '坡', '馆', '鸟', '庙', '楼', '申', '岔', '泥', '岚', '鸡', '窝', '贸', '寸', '队', '芒', '岙', '坝', '至', '凹', '圳', '塝', '顶', '医', '亩', '肚', '卤', '汁', '磨', '显', '偏', '坑', '尼', '寮', '打', '陶', '饶', '坞', '挂', '搓', '凰', '砍', '伐', '畔', '脚', '甲', '窠', '塘', '埂', '企', '划', '窖', '菜', '垟', '稀', '冧', '服', '闸', '斜', '娄', '寨', '勃', '陀', '韵', '寺', 'f', '敞', '铜', '盘', '排', '蛮', '邮', '尕', '炮', '屋', '绣', '吊', '午', '祁', '管', '骑', '渠', '架', '寿', '盒', '芭', '缇', '仲', '土', '宅', 'v', '久', 'l', '峪', '咀', '塬', '坎', '墩', '委', '布', '苦', '炼', '龟', '屿', '报', '鲁', '涯', '蛇', '伊', '吃', '扑', '猫', '羊', '火', '锅', '棉', '氏', '柑', '腊', '坳', '柴', '仓', '勤', '片', '崩', '湴', '埚', '怡', '峡', '洼', '佘', '堆', '讯', '峁', '倍', '伙', '冉', '崇', '厅', '鞑', '盖', '渔', '皂', '碾', '祠', '巢', '涌', '墙', '妆', '卖', '暖', '柜', '农', '牧', '榨', '塞', '懋', '恭', '淳', '引', '堡', '秧', '烂', '浆', '梯', '购', '桶', '瓦', '葫', '柄', '极', '兄', '槽', '梭', '娘', '沥', '烛', '贡', '炉', '陇', '誉', '味', '楠', '巴', '棚', 'M', '药', '贝', '麻', '计', '尊', '仁', '璜', '圩', '妍', '熙', '嘴', '杏', '鑫', '埔', '阁', '荒', '奴', '挟', '叉', '硬', '穆', '梵', '畈', '鞋', '穿', '陕', '汽', '眼', '镜', '旧', '壁', '拐', '伦', '往', '陡', '苟', '索', '抓', '熟', '儒', '塆', '粉', '莫', '榔', '凼', '鲤', '陂', '铺', '拱', '鳍', '垭', '澹', '蟮', '窑', '爆', '刑', '厨', '垌', '洗', '衣', '蓬', '茸', 'Ｅ', '驴', '秃', '葡', '萄', '池', '萨', '捻', '席', '丘', '垅', '昔', '泗', '劲', '郎', '勾', '桲', '椤', '爷', '毚', '饰', '彰', '呷', '妈', '臣', '鸳', '鸯', '瀑', '板', '狮', '弯', '吞', '雁', '您', '腰', '迟', '热', 'L', '!', '拨', '翻', '鲜', '锜', '垸', '岑', '耿', '榕', '甸', '苍', '驿', '奇', '落', '芋', '灰', '驹', '桑', '斗', '党', '办', '受', '禧', '稽', '夜', '螺', '悟', '吗', '御', '足', '梓', '旱', '贾', '当', '町', '垱', '茜', '玖', '崴', '桦', '滚', '沱', '吨', '歹', '毒', '纺', '织', '腐', '柱', '遂', '骄', '堤', '者', '杀', '耐', '拿', 'V', '瓜', '汀', '樟', '雀', '脑', '梨', '荩', '嘎', '闩', '厝', '哨', '夹', '烧', '剧', '槌', '孜', '篱', '笆', '敢', '鄂', '臧', '漂', '啊', '潼', '茅', '栋', '蹬', '爬', '仍', '插', '颐', '稻', '住', '芷', '扯', '庵', '蓟', '鸦', '浑', '冷', '埲', '鼻', '椿', '扎', '霍', '岸', '税', '返', '垦', '雍', '搬', '鸠', '瞎', '魔', '鬼', '暗', '纳', '埗', '副', '食', '扈', '聘', '舜', '闲', '派', '凝', '匹', '帮', '停', '浦', '仪', '煤', '炭', '鼠', '笼', '棣', '浪', '浴', '绿', '峃', '婚', '纱', '辆', '夫', '泾', '倒', '汾', '豁', '顿', '货', '邑', '姐', '扇', '买', '鼓', '赤', '疗', '倾', '千', '笃', '漕', '粤', '愚', '绒', '茗', '粑', '刷', '钮', '獾', '童', '垣', '芙', '玥', '宰', '沪', '灶', '窟', '岜', '隔', '萝', '窦', '崎', '铂', '宫', '赣', '榆', '蹄', '碑', '歧', '又', '耳', '跃', '话', '啦', '咩', '闫', '涮', '汞', '柘', '支', '踏', '穗', '砬', '朗', '厄', '船', '棕', '榈', '协', '阔', '戎', '弓', '桌', '扒', '缸', '陷', '狗', '娃', '猪', '浯', '寄', '汗', '迳', '鹿', '碉', '粮', '涧', '匡', '氿', '灌', '澜', '郁', '囱', '孩', '枇', '杷', '盆', '险', '蕉', '厍', '浜', '铝', '缤', '纷', '锣', '滴', '廓', '萱', '喆', '鹭', '刁', '竺', '屠', '钓', '藉', '榭', '岐', '蜡', '恰', '障', '女', '截', '驼', '丫', '券', '股', '婆', '弟', '档', '宦', '甫', '候', '袜', '玻', '璃', '隧', '垵', '舍', '弹', '檀', '低', '垄', '肯', '姆', '坂', '杖', '煲', '岱', '昂', '蟠', '卞', '乱', '私', '舟', '啷', '枧', '匠', '淘', '溇', '菡', '辣', '蔺', '趟', '庾', '坨', '鄢', '兔', '籽', '晒', '厚', '颈', '衙', '懒', '托', '墓', '喷', '岁', '壤', '刀', '砖', '洒', '怕', '柿', '靓', '礌', '纤', '阎', '兜', '喀', '斑', '租', '膏', '杆', '奕', '蜈', '蚣', '搏', '垴', '瓷', '咖', '啡', '摆', '曜', '裘', '哄', '丧', '垂', '箐', '慢', '摇', '牟', '血', '邻', '更', '砂', '俄', '蛳', '烤', '入', '荡', '嗌', '嶂', '寇', '笋', '扛', '壶', '敖', '茴', '眉', '钩', '槎', '嗒', '糖', '鹅', '郢', '澳', '妥', '壕', '靠', '涝', '蚂', '蚁', '甚', '仕', '蚊', '堵', '佐', '帽', '渝', '盔', '斋', 'q', '覃', '馒', '洱', '储', '蓄', '陌', '畲', '纲', '帝', '寒', '歪', '醒', '投', '瞿', '斩', '漫', '棵', '耶', '稣', '殊', '锁', '抹', '举', '渤', '梧', '醪', '典', '染', '冗', '苇', '闵', '纵', '瓶', '丈', '穷', ';', '胖', '烫', '瀚', '忘', '降', '销', '猛', '吸', '凳', '奈', '抗', '援', '戈', '休', '胆', '滥', '漾', '谈', '控', '块', '仰', '欠', '柒', '泄', '零', '桎', '蝗', '吓', '呀', '懵', '钰', '蛟', '芮', '窨', '廷', '融', '召', '骂', '厕', '莪', '肇', '腔', '郦', '驾', '闻', '晖', '倚', '皓', '忙', '邦', '哥', '粥', '琪', '漱', '轿', '莽', '螳', '螂', '粱', '渎', '拜', '埕', '耍', '猴', '哎', '笠', '劳', '咸', '亨', '哑', '菱', '央', '嫩', '彝', '驻', '绳', '圪', '悲', '伤', '臭', '费', '淌', '忽', '硝', '妇', '骨', '妃', '奎', '宛', '宽', '警', '峻', '冶', '瞓', '蓓', '漆', '告', '衬', '轴', '沐', '喇', '叭', '炫', '烽', '菖', '糯', '膳', '迷', '垒', '纠', '煮', '沅', '犁', '幺', '扁', '垓', '沸', '拒', '顷', '嘶', '跑', '蔬', '娅', '蒿', '筑', '蜘', '蛛', '渗', '溜', '防', '蒸', '虾', '桅', '跳', '浓', '蹇', '髻', '推', '挖', '邸', '枯', '榴', '俪', '隍', '锡', '撒', '陬', '浇', '枝', '污', '麒', '麟', '羽', '埭', '碗', '伴', '箬', '掉', '待', '杠', '薳', '乳', '炸', '塑', '槟', '禹', '肉', '故', '陪', '裴', '鹦', '鹉', '佑', '狭', '柞', '闹', '汨', '闷', '阚', '闽', '孤', '圭', '腮', '@', '叱', '?', '聊', '塅', '鸽', '叙', '困', '早', '剪', '泸', '埇', '茨', '摩', '找', '批', '蛋', '乪', '咁', '峙', '圹', '蜀', '悒', '鳄', '铧', '磅', '滧', '潞', '獐', '拖', '倘', '它', '堪', '岫', 'K', '稍', '瀛', '瑟', '蜜', '渐', '甩', '俱', '麂', '沽', '渭', '虫', '敦', '怪', '肾', '透', '恕', '沃', '丸', '芽', '筒', '洑', '蓢', '纹', '轧', '隘', '叫', '呱', '燃', '搭', '狐', '睦', '灏', '叻', '弘', '堯', '票', '菩', '楝', '洙', '汴', '穴', '柚', '荻', '涅', '俾', '澄', '急', '救', '吟', '仝', '碱', '遮', '猄', '汶', '淡', '采', '厘', '呢', '阵', '韭', '辕', '禅', '侧', '霸', '紧', '挜', '拃', '堀', '唤', '磜', '愿', '庐', '雌', '蟥', '卧', '咳', '堑', '枕', '椅', '橱', '涟', '凸', '迮', '伸', '圃', '藕', '讨', '棍', '侍', '尺', '缪', '翡', '嫁', '冒', '亳', '莘', '钗', '退', '耙', '齿', '吾', '塍', '棺', '瑜', '哇', '旁', '饼', '灭', '箱', '郗', '芎', '弦', '琦', '病', '袍', '筲', '箕', '墟', '沾', '移', '辊', '铛', '霄', '爪', '栈', '妖', '盼', '被', '浔', '乙', '拓', '泮', '夕', '郄', '哆', '咪', '薪', '汲', '簸', '割', '磴', '撇', '稳', '祈', '雯', '撕', '裤', '裆', '炜', '桔', '菠', '靴', '赶', '晏', '潇', '剳', '秣', '烯', '宿', '耕', '送', '笨', '炖', '绞', '嵌', '撞', '★', '綦', '畜', '嵩', '焗', '竉', '亏', '弈', '玩', '爽', '蟹', '惹', '蛙', '澡', '璋', '层', '碟', '盾', '履', '栎', '琵', '琶', '怒', '淖', '摄', '矶', '埤', '鹊', '抬', '浣', '孵', '吐', '互', '羌', '焕', '捣', '臼', '爿', '操', '玫', '瑰', '蚕', '径', '嚟', '唔', '鸶', '筛', '逆', '焖', '帕', '碰', '瘦', '散', '晟', '垠', '湟', '裟', '稔', '帛', '拦', '洮', '死', '邨', '绪', '寰', '峦', '劫', '秸', '箩', '桩', '渣', '雒', '栖', '烘', '誓', '噗', '稠', '崧', '蛾', '尉', '蛤', '揣', '垛', '豹', '拢', '搵', '罩', '漪', '追', '床', '雾', '磺', '炒', '讷', '鄱', '胥', '凇', '碓', '捞', '爵', '侬', '帘', '奖', '畴', '叔', '橇', '艮', '茆', '浮', '搞', '串', '逐', '榄', '琉', '赢', '介', '黔', '佬', '奚', '淹', '丑', '鏊', '罕', '掘', '轭', '囊', '措', '藤', '浸', '额', '砭', '泛', '砌', '盏', '厢', '篙', '臂', '荀', '咔', '乜', '瓢', '簖', '璞', '帐', '矮', '堌', '篷', '岽', '恶', '牯', '疃', '芥', '抛', '袋', '涔', '揉', '媛', '瞭', '檬', '拍', '徽', '硃', '坜', '淄', '罐', '藻', '杞', '柔', '嘀', '葵', '敷', '棱', '珑', '钞', '枪', '犀', '钊', '谏', '鸹', '匀', '鳌', '稗', '扶', '抽', '担', '溆', '逍', '残', '汕', '拘', '偶', '猎', '墈', '擂', '父', '啤', '蟆', '戟', '崂', '垇', '秒', '曙', '泵', '砻', '挥', '榛', '毡', '婧', '燎', '邬', '鲨', '滘', '硎', '咱', '埋', '况', '馍', '郫', '饿', '坭', '宠', '睇', '衰', '却', '氹', '促', '焉', '脉', '湄', '赐', '潦', '咗', '甑', '醍', '醐', '授', '栢', '押', '姊', '荞', '废', '娱', '瘾', '蘑', '菇', '峒', '魁', '驮', '洺', '拥', '沭', '蝙', '伞', '卦', '糟', '腿', '酱', '抱', '跨', '钳', '橙', '瓮', '垡', '灾', '郜', '攻', '拧', '侃', '谱', '濠', '饮', '篮', '蹦', '颉', '隐', '翅', '适', '楸', '孚', '袖', '锤', '濂', '冢', '悬', '硖', '涉', '烨', '歇', '涑', '鹧', '鸪', '遇', '胸', '屎', '翾', '夭', '骅', '珈', '眷', '篁', '伽', '峄', '靛', '岌', '摘', '糕', '脂', '饺', '廻', '剥', '湫', '茁', '園', '廣', '署', '番', '孭', '舫', '莞', '腕', '另', '硼', '桴', '轰', '勘', '砩', '蜻', '蜓', '庹', '颛', '埝', '冇', '妞', '蚝', '橦', '琅', '挡', '宕', '祚', '爹', '宵', '冕', '泠', '幕', '溅', '叹', '魅', '冼', '括', '創', '復', '興', '煎', '酉', '晃', '侗', '契', '磙', '漏', '仚', '凫', '仞', '啸', '抄', '酸', '奏', '兆', '嘛', '桤', '递', '狄', '缅', '枭', '栅', '棬', '哀', '琰', '濑', '豫', '玕', '鳖', '脸', '抵', '帚', '啄', '磷', '谓', '傍', '偷', '樱', '肠', '凭', '骚', '鳗', '洨', '邝', '吖', '恋', '斤', '莺', '冻', '浅', '珞', '扦', '咨', '殡', '鬑', '滦', '迈', '碁', '肿', '瘤', '挞', '泺', '蒂', '蚶', '鲸', '且', '巾', '馋', '梗', '襟', '喊', '葱', '概', '岷', '沂', '淇', '垮', '骡', '酿', '仉', '唉', '褡', '裢', '峨', '炬', '狸', '嵋', '萤', '鲈', '瑙', '佃', '啰', '构', '薇', '吒', '癞', '焰', '蝻', '旮', '旯', '睿', '硚', '扭', '扣', '斧', '昊', '胞', '峧', '励', '篆', '箭', '犬', '锐', '绶', '飘', '遵', '饲', '炎', '揽', 'Q', '婷', '碶', '涨', '逻', '迁', '倩', '胎', '珏', '竜', '嵇', '浒', '逃', '暹', '筏', '咧', '醋', '喂', '昕', '渚', '疙', '瘩', '巡', '迅', '媒', '燐', '皆', '濉', '芨', '茄', '栾', '昙', '挨', '恼', '碎', '婵', '勺', '岘', '呐', '寝', '荖', '瘟', '宴', '酷', '蒜', '抢', '孖', '消', '吼', '渌', '汊', '烦', '钥', '匙', '窗', '演', '筠', '赏', '售', '螃', '茌', '礁', '离', '夷', '镰', '逯', '献', '粒', '牡', '箍', '鲢', '阡', '啲', '桷', '裇', '嚿', '皖', '鸥', '洵', '聋', '蟒', '粟', '荏', '哼', '潜', '隋', '猗', '濮', '榻', '朔', '拇', '郓', '硐', '肌', '肤', '厣', '砚', '撮', '硅', '削', '祭', '莼', '徂', '徕', '彼', '丕', '捏', '蔷', '杲', '隅', '苜', '蓿', '毓', '寡', '剅', '麓', '挚', '议', '韬', '曦', '睡', '迤', '坵', '豚', '蝉', '_', '略', '锌', '甏', '缬', '袄', '绥', '戒', '戛', '袅', '盗', '砧', '遍', '荥', '札', '汰', '缨', '催', '慕', '缝', '纫', '辜', '绅', '瓯', '浃', '禇', '噢', '霓', '洈', '震', '丞', '菌', '礅', '帼', '弗', '彥', '陨', '硫', '锥', '媳', '拳', '蝴', '漓', '骥', '杯', '芟', '洽', '菁', '懿', '驳', '垯', '峇', '缩', '允', '减', '塌', '荪', '壑', '枞', '喃', '亢', '茉', '碳', '夸', '荟', '矣', '雕', '覆', '燚', '斐', '捕', '钵', '禺', '址', '虢', '垫', '衫', '漠', '幻', '抻', '泖', '脖', '哋', '预', '懑', '遗', '倭', '淤', '蔗', '凿', '荐', '兽', '戏', '畛', '幢', '肺', '鹫', '滇', '鲮', '凛', '莳', '桀', '唱', '珂', '枚', '贪', '夯', '楂', '黛', '咬', '舵', '郇', '鹞', '嗯', '俸', '枋', '射', '椰', '馥', '谌', '脱', '龛', '泃', '赜', '软', '汐', '夼', '颅', '暴', '．', '鞠', '杬', '罡', '嗰', '溯', '筷', '镀', '晁', '婴', '她', '埃', '崾', '碌', '黐', '呔', '塱', '璟', '眺', '泓', '筇', '膜', '埌', '衮', '劈', '涪', '佟', '１', '８', '５', '颗', '脐', '拔', '狱', '豌', '呆', '搜', '眠', '挺', '幔', '狂', '奓', '俩', '陟', '歆', '氩', '刻', '诈', '奸', '淙', '侣', '攋', '尿', '侠', '撬', '砸', '稼', '艇', '湿', '砥', '廉', '酥', '珲', '宓', '仟', '拆', '苎', '糊', '楞', '账', '仗', '凶', '厩', '姥', '氧', '萌', '勐', '岞', '诱', '夺', '瑚', '埒', '屑', '缠', '琊', '披', '磕', '旷', '菅', '颍', '薏', '缵', '陞', '湔', '昝', '脆', '爸', '鞘', '谂', '遐', '俗', '贼', '暧', '算', '竣', '刊', '玺', '驸', '祺', '芸', '苴', '邺', '嘁', '氮', '漈', '喔', '虱', '蕨', '焊', '悠', '屁', '剂', '桠', '祛', '痣', '珀', '喝', '璐', '睛', '庇', '璇', '掂', '扩', '锯', '丢', '崭', '憩', '圻', '览', '亥', '舌', '跌', '佤', '鞭', '醇', '枷', '昇', '滔', '疯', '’', '舶', '尽', '绮', '溧', '撩', '罪', '坷', '鸾', '喳', '蝠', '濯', '瞳', '妤', '某', '椴', '癌', '症', '罢', '携', '乎', '谋', '锚', '删', '垚', '樑', '毯', '砦', '捱', '乏', '奄', '６', '簇', '贩', '崮', '…', '茯', '苓', '猜', '盎', '诏', '渟', '谙', '杈', '辫', '绸', '暮', '奢', '猬', '笛', '趸', '壬', '戙', '氯', '呥', '阀', '纽', '稷', '坯', '吻', '译', '胭', '茎', '涤', '翘', '―', '棘', '婕', '峤', '凑', '墘', '袭', '害', '蔚', '蝎', '馄', '饨', '督', '恤', '橄', '姻', '啋', '沫', '腻', '彻', '茧', '兑', '帖', '²', '玮', '吥', '筻', '盲', '疾', '荃', '吝', '裁', '莒', '赠', '啥', '暂', '糠', '%', '瓣', '尝', '躺', '乍', '榧', '帜', '乸', '抦', '阙', '烺', '桕', '枥', '塄', '竖', '浐', '峥', '嵘', '磚', '醛', '腋', '‘', '诉', '逝', '虽', '款', '缆', '仃', '苞', '黍', '墕', '踩', '苔', '肩', '茈', '昵', '蓼', '恐', '剃', '鳃', '赚', '蚀', '痴', '绰', '贠', '迂', '迢', '碥', '趴', '孕', '粹', '卵', '换', '锨', '迦', '葑', '借', '羞', '饩', '揸', '滂', '羔', '坍', '捐', '锛', '竿', '搂', '败', '瞧', '憨', '岺', '鬃', '蓥', '梆', '琯', '诰', '焱', '窊', '嘢', '啟', '訾', '菀', '窿', '锈', '贻', '勉', '芍', '贫', '晔', '踅', '镁', '煜', '苘', '淞', '似', '距', '锂', '萃', '椽', '脊', '泌', '磉', '弱', '郴', '皎', '轱', '辘', '笪', '珙', '滤', '呕', '沋', '哩', '浏', '秆', '忆', '璧', '熬', '颂', '弧', '兹', '闪', '喼', '茱', '萸', '篓', '漷', '耗', '垃', '圾', '刮', '耒', '轨', '卯', '橘', '笈', '躝', '尸', '趷', '谅', '佮', '毗', '堕', '艰', '鴜', '碣', '栽', '邈', '雩', '崦', '敌', '於', '鲇', '枰', '邰', '滹', '忍', '杵', '鳞', '樽', '肛', '掖', '惊', '宸', '穹', '雲', '拂', '剩', '鲊', '螯', '铲', '尞', '呜', '访', '亓', '链', '箦', '胫', '癫', '拣', '娲', '醴', '巍', '笭', '缦', '喉', '畦', '尘', '疫', '葩', '叩', '蠡', '燥', '骐', '凃', '挪', '泼', '垧', '嘥', '麽', '迩', '鸬', '鹚', '绢', '愁', '鹳', '閣', '钏', '虬', '磻', '旻', '汜', '溟', '犹', '犯', '涞', '墁', '鲘', '嫂', '廒', '枢', '扽', '舱', '漩', '發', '叮', '腌', '兖', '灞', '胤', '鳝', '潢', '扉', '簧', '钜', '掣', '脏', '茬', '纶', '鲫', '梢', '跸', '替', '腺', '扔', '牲', '愕', '蕃', '筵', '滁', '鲀', '煦', '淝', '邪', '佗', '傣', '蜇', '裳', '腍', '祯', '邛', '黟', '贷', '盱', '眙', '锭', '啖', '旬', '烩', '逊', '滠', '砀', '硇', '牵', '牦', '狍', '矽', '唻', '蔸', '亡', '赉', '猢', '狲', '蜗', '韧', '邗', '僚', '牢', '敝', '菘', '罨', '雹', '粪', '羲', '飓', '骊', '沌', '嬲', '馏', '迫', '楮', '浊', '裂', '芯', '筋', '橛', '逄', '谕', '决', '坉', '銮', '漭', '嚷', '挤', '禽', '搣', '喘', '阑', '窘', '筱', '華', '貌', '恂', '鳅', '迓', '圐', '圙', '汈', '奂', '畹', '混', '俺', '肝', '埸', '啪', '势', '咕', '椹', '焙', '|', '椑', '※', '漯', '卑', '囤', '巽', '汛', '吵', '捧', '崀', '霉', '捉', '颇', '茭', '镬', '□', '嘟', '扮', '佴', '循', '萼', '獠', '哭', '缶', '秤', '邳', '眯', '昨', '诒', '翌', '躲', '匪', '廿', '仆', '饱', '丼', '毘', '龄', '垾', '牤', '矾', '缴', '驷', '戽', '奠', '皿', '塚', '弋', '蹈', '剡', '榃', '坋', '邕', '焯', '咯', '酶', '耨', '涿', '乞', '裸', '饥', '渴', '崑', '蚬', '汫', '嶅', '筝', '堎', '旌', '潝', '栓', '眞', '孛', '践', '籍', '幽', '闺', '晕', '酡', '畏', '溦', '糙', '杓', '苕', '霅', '傑', '迭', '澧', '胪', '膛', '鸵', '辞', '畸', '妗', '亘', '绛', '腹', '哞', '芫', '罅', '垷', '赊', '挽', '藁', '匣', '趾', '喺', '厮', '殳', '屌', '垤', '氨', '籁', '梽', '浛', '洸', '坬', '耷', '冤', '戾', '瞦', '刨', '吽', '哣', '瞰', '溉', '腩', '璩', '殓', '矛', '鹁', '塥', '辿', '酃', '褪', '甬', '恬', '崞', '仿', '枸', '雉', '肆', '吱', '埫', '霏', '徳', '揖', '朐', '膀', '矫', '軬', '鹃', '栀', '岿', '褛', '泷', '屺', '缎', '激', '弼', '衿', '炽', '沔', '佢', '堨', '膶', '惨', '捌', '阱', '蚤', '霹', '哉', '忧', '渺', '哃', '麖', '苛', '顽', '闾', '谨', '慰', '湧', '涡', '坏', '矩', '忌', '碛', '掏', '怯', '捆', '俣', '拴', '啱', '涐', '滞', '辋', '夅', '渲', '贮', '麾', '９', '羡', '肢', '睩', '胀', '踢', '坌', '击', '抌', '搪', '氰', '氟', '噁', '唑', '碇', '坣', '窎', '棹', '胃', '酬', '鹄', '舦', '拯', '壆', '摊', '肋', '铳', '坼', '唠', '钨', '恨', '趔', '趄', '昏', '楣', '琐', '锄', '潺', '盂', '櫈', '悉', '聖', '般', '噉', '嚼', '瞻', '睫', '珅', '畚', '谜', '耩', '輋', '滏', '拎', '畀', '屲', '瞑', '猷', '攸', '筐', '琲', '庑', '卿', '揿', '侵', '踞', '砲', '４', '翊', '戳', '赧', '痛', '鄯', '蜢', '肪', '幌', '沏', '辗', '逼', '茔', '觞', '钺', '郅', '傻', '滓', '欲', '捶', '噶', '鎏', '轸', '糜', '餘', '揦', '揾', '２', '獴', '祗', '碡', '玳', '蔻', '颠', '－', '洄', '歩', '淦', '戥', '芾', '盅', '迴', '羚', '熏', '嘭', '矢', '劣', '&', '錡', '燶', '茏', '佧', '鲞', '嘿', '趌', '樵', '谣', '赌', '筹', '恺', '缓', '皱', '芊', '郏', '桨', '卸', '巉', '礐', '桁', '赋', '秉', '泪', '咚', '癸', '磐', '瑾', '煞', '眭', '裔', '闭', '骗', '祐', '逗', '祸', '褒', 'Ｊ', 'ｏ', 'ｒ', 'ｄ', '紊', '扼', '镠', '邀', '摁', '浿', '歉', '飚', '樨', '泘', '馀', '恢', '触', '俯', '溥', '铰', '薯', '檐', '挹', '慌', '沓', '槛', '侦', '僧', '琎', '毁', '咘', '蕙', '峩', '寶', '炕', '兼', '撑', '葬', '鲶', '哗', '镐', '鋆', '嫚', '郐', '邋', '遢', '躬', '３', '隙', '淠', '驶', '攞', '甪', '苌', '莓', '哒', '脾', '乖', '笕', '瘌', '痢', '崆', '轳', '姨', '锶', '蘸', '畖', '撂', '仄', '扐', '趋', '侉', '陋', '桫', '{', '嵯', '苋', '砣', '獭', '茫', '捍', '蹲', '荚', '抖', '豢', '篦', '卒', '嚡', '熠', '滆', '遛', '撤', '煨', '邾', '掇', '糍', '惜', '啝', '臊', '疼', '晾', '嘡', '貂', '邴', '漹', '蕫', '吏', '櫼', '烁', '予', '嗱', '岕', '氽', '痫', '漖', '骟', '斓', '睁', '馅', '沼', '赁', '焚', '岵', '陉', '沆', '庶', '俶', '冚', '瑁', '葳', '趯', '奤', '夿', '镝', '凄', '風', '掐', '揗', '酪', '爧', '甥', '锟', '檗', '膊', '鹂', '罂', '倡', '菏', '倮', '翀', '\\', '菉', '甭', '玑', '浬', '溃', '僆', '蔑', '熹', '蜚', '既', '琛', '簿', '骈', '鹘', '鵳', '簕', '溴', '琥', '瓤', '烙', '鳔', '鳕', '铠', '菰', '曰', '谟', '嘅', '渥', '绾', '蓑', '铨', '阊', '焫', '崽', '砘', '郧', '髀', '瑛', '薰', '溱', '槲', '澥', '砺', '窈', '娴', '爻', '泯', '枨', '靶', '栲', '栳', '琚', '辇', '偈', '屄', '骝', '脯', '秩', '娆', '坮', '罉', '酢', '鱿', '擤', '蕰', '叡', '珺', '屐', '蜿', '蜒', '笏', '喱', '泻', '唛', '紹', '呃', '聆', '淰', '啼', '铎', '趁', '炯', '憬', '韫', '雇', '祜', '阆', '赴', '釜', '俚', '嗦', '掩', '铖', '堠', '嗓', '痰', '呗', '嫒', '唆', '琏', '壵', '峋', '驯', '薜', '铡', '婿', '嗽', '铿', '锵', '沩', '叼', '祀', '徼', '纣', '掠', '钝', '乒', '乓', '拌', '峏', '濛', '熄', '椟', '垆', '鹩', '徘', '徊', '挣', '砑', '鍋', '绀', '渑', '湍', '榅', '怜', '腥', '赔', '咤', '嘲', '哓', '敕', '幅', '妒', '倌', '≤', '锻', '卅', '吩', '咐', '嗡', '魂', '禡', '郚', '窬', '艚', '芡', '舖', '沤', '弃', '贰', '惦', '狡', '黠', '舆', '侄', '妨', '碍', '睢', '匾', '瓠', '昱', '衔', '锷', '粽', '偃', '}', '歙', '戊', '惬', '蟀', '洣', '朽', '澔', '鲠', '撖', '镔', '潩', '肘', '狠', '咋', '呇', '瞪', '槁', '擎', '涩', '蠢', '跪', '褐', '碚', '叟', '醫', '療', '捎', '敲', '镶', '痘', '绚', '咛', '蔴', '蝌', '蚪', '沣', '佚', '刈', '莴', '谯', '執', '蒯', '吁', '沮', '埰', '妻', '蝇', '芈', '抠', '饵', '籴', '俵', '蒌', '絮', '鲩', '喵', '枉', '癜', '圯', '淼', '岈', '惟', '郞', '斛', '噜', '傜', '蟛', '蜞', '钒', 'Ｏ', '戌', '翎', '踊', '羹', '旸', '犍', '倬', '弛', '鞅', '裱', '褙', '嵬', '贲', '揠', '歡', '债', '芶', '澉', '砰', '蚱', '哙', '戬', '赦', '铙', '钹', '髓', '舅', '袱', '诞', '擀', '霁', '鲂', '肴', '蓍', '霎', '呤', '澐', '翩', '菽', '闰', '辄', '雏', '瑀', '飒', '擅', '琢', '驱', '嗅', '辈', '橹', '關', '嶝', '７', '宥', '仵', '噹', '擒', '莨', '嗖', '蓖', '憋', '煊', '硠', '菓', '箫', '浉', '滢', '篾', '螆', '蟾', '蜍', '崤', '叨', '钲', '仨', '搅', '耆', '蘭', '餍', '嗲', '劏', '雳', '扰', '佶', '锰', '笙', '烹', '炊', '漢', '岂', '葭', '淅', '郯', '辨', '锝', '稞', '彗', '鸢', '喎', '皈', '坻', '钣', '劵', '奀', '吔', '橫', '莜', '窍', '翳', '賓', '涣', '囚', '廨', '叁', '︰', '儋', '湳', '楹', '膑', '镛', '臜', '隰', '伪', '嫌', '磡', '屙', '唧', '哝', '犋', '咻', '墎', '缫', '镆', '狩', '遭', '锺', '哮', '咽', '婪', '酯', '哏', '蓁', '诃', '垢', '犇', '捺', '咒', '碘', '埘', '戍', '挛', '浈', '弊', '岢', '嗮', '坠', '祷', '墒', '窃', '蛆', '轶', '肽', '伢', '珩', '刹', '佣', '霈', '膨', '囿', '偕', '垞', '啃', '犊', '厌', '瞒', '泐', '嵛', '骘', '炔', '榉', '裙', '涓', '祉', '鸷', '奡', '偿', '玍', '捂', '崪', '苯', '缑', '赭', '湃', '洹', '愣', '桉', '庠', '囝', '硷', '娉', '剁', '羿', '浞', '哟', '辖', '抆', '蘅', '鲎', '釉', '噼', '娶', '揍', '妾', '牮', '哽', '胐', '咿', '喐', '忱', '扳', '爨', '恣', '墱', '扤', '潴', '扆', '簪', '诡', '矸', '炅', '崃', '稚', '憎', '巅', '杧', '钼', '飙', '酌', '笊', '挠', '邙', '瑕', '疵', '浤', '憾', '莅', '酋', '罾', '砾', '锞', '菢', '賀', '嵗', '鄹', '×', '馗', '馈', '窜', '浠', '豸', '婄', '査', '旨', '腬', '耸', '璎', '寥', '喏', '鳯', '鄣', '廪', '浍', '俎', '桄', '憧', 'Ａ', 'ｍ', '喽', '鬈', '欺', '猾', '蛰', '蛭', '堧', '碜', '篝', '纂', '褂', '胳', '咈', '谮', '秭', '虑', '燊', '俬', '豺', '艄', '獒', '踭', '鄄', '诧', '晤', '瑄', '⑤', '叽', '炀', '隗', '$', '镡', '瘸', '匮', 'Ｕ', '缉', '罟', '芩', '毙', '穀', '晗', '烊', '谒', '囄', '昀', '鹌', '鹑', '讴', '芤', '髡', '钡', '伾', '嗣', '耘', '轘', '猞', '猁', '弶', '「', '萬', '拗', '讶', '軒', '蒡', '囡', '捡', '侑', '瞅', '髽', '鼋', '骋', '溺', '舁', '湗', '颡', '隽', '掹', '蕲', '捋', '钙', '義', '镭', '弩', '噏', '痒', '妪', '學', '币', '滍', '澌', '轵', '餸', '呦', '筼', '筜', '帏', '芪', '恳', '谠', '～', '財', '艔', '芗', '翙', '憇', '囔', '唷', '舲', '痧', '虐', '鱻', '旒', '厥', '⑥', '钾', '玡', '蹊', '唏', '膝', '楦', '鳟', '霊', '呸', '蛨', '濡', '囟', '芘', '姣', '跷', '俨', '嗨', '忿', '嫖', '妓', '嫲', '婢', '疋', '姝', '愈', '腴', '椗', '瓴', '瘫', '跛', '岣', '嵝', '翱', '伲', '淯', '孻', '遄', '薀', '隈', '沦', '泇', '脰', '箴', '暄', '悭', '咥', '蠄', '蟝', '麋', '悸', '嫣', '瘀', '陔', '皤', '篼', '鲖', '酂', '嘈', '鷺', '視', '聼', '垲', 'Ｓ', '剋', '娣', '鉄', '桧', '撷', '岬', '掬', '氛', '毋', '桢', '邡', '役', '杳', '刃', '蔟', '訇', '涕', '甯', '島', '舀', '撛', '贬', '衷', '師', '弁', '噎', '棯', '貴', '掕', '漴', '噻', '溁', '镯', '鄮', '阪', '蛏', '嚒', '槚', '舸', '薮', '逛', '峣', '禀', '粵', '題', '廳', '拷', '噖', '０', '蚓', '斡', '峭', '纰', '瓹', '檑', '挫', '崋', '骞', '璨', '丬', '铤', '毂', '堽', '疬', '熔', '鲲', '疤', '钇', '鹗', '兀', '犂', '珉', '髦', '潋', '枃', '熨', '叆', '睺', '厾', '袛', '嘞', '缌', '蛊', '霆', '奅', '蜊', '吆', '粦', '募', '荨', '叛', '嵖', '讣', '窕', '拈', '痱', '沚', '崄', '薤', '猿', '辂', '蚨', '贿', '赂', '簋', '噍', '泣', '咦', '睐', '锴', '笱', '熳', '翥', '辟', '④', '苳', '蒴', '闳', '奘', '戆', '觃', '洳', '忸', '怩', '書', '嶽', '啉', '館', '笤', '悍', '昧', '歐', '鮑', '扊', '扅', '惶', '澍', '朦', '胧', '楊', '黉', '笮', '埑', '舥', '藿', '患', '嘱', '踎', '蠕', '値', '樾', '钛', '掅', '栊', '硿', '悼', '怖', '枳', '喧', '曌', '诲', '湓', '鏡', '朕', '侏', '趱', '拽', '愧', '钆', '塭', '啬', '嚏', '嗷', '磬', '祊', '钠', '擗', '讽', '跋', '貔', '摞', '僖', '簰', '颊', '玟', '匝', '泔', '醮', '璀', '獬', '镒', '硒', '稆', '焜', '貉', '笸', '艋', '垙', '寂', '坺', '簡', '瑷', '硙', '盵', '曳', '蛎', '嚎', '揪', '怨', '鮀', '愤', '笄', '濒', '栆', '簊', '瀘', '楷', '蟋', '栩', '畎', '塾', '膘', '雜', '阗', '玙', '朏', '洚', '蟑', '胙', '脷', '泱', '隨', '緣', '唞', '筀', '摔', '眨', '沄', 'Ｌ', 'Ｄ', '仡', '俫', '昼', '骇', '嫦', '舢', '橼', '矬', '綵', '抒', '琬', '硍', '劼', '饕', '崁', '洧', '鍟', 'Ｒ', '溵', '绯', '窥', '缈', '嚓', '骷', '髅', '羯', '瞥', '旎', '濆', '绑', '窒', '咆', '國', '苧', '腈', '缔', '琮', '逹', '趵', '唿', '铆', '蚧', '郪', '埞', '僻', '砟', '蟧', '盡', '^', '鄙', '隶', '渼', '咙', '矜', '嗻', '贱', '嗬', '悃', '燧', '鎅', '屘', '肶', '旄', '殇', '唂', '阇', '啵', '簌', '甽', '門', '揈', '莦', '恽', '鶄', '骧', '農', '啜', '妄', '镘', '￥', '瑪', '臨', '嗝', '荇', '驭', '惋', '蕺', '炝', '嚤', '钯', '粝', '豉', '祟', '曚', '囫', '囵', '濞', '啫', '埼', 'Ｂ', '銀', '寞', '圌', '傈', '僳', '龍', '鰽', '褥', '孬', '涢', '撰', '铮', '擘', '薅', '呣', '栟', '逵', '捩', '灜', '鈪', '陳', '樂', '甦', '锹', '蚯', '涎', '罘', '馓', '俑', '☆', '﹀', '╮', '飱', '肄', '搲', '暇', '谛', '嬉', '籣', '痪', '餮', '郾', '旖', '蝲', '诣', '莰', '荙', '罚', '凎', '鲟', '⒁', '柽', '谚', '呋', '蔽', '麗']
    """
